#### 1. Data Preprocessing
##### Importing of necessary liberaries and our dataset, which is presently stored in a csv file format, titled 'giant order dump.csv'.The columns of the dataset are not helpful and we look to rename these to conventional column names that we are used to working with.

In [251]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [252]:
col_names = ['customer_id', 'order', 'total_sales', 'date', 'site' ]

bgs_raw = pd.read_csv("giant order dump.csv", names = col_names , parse_dates=[3])
bgs_raw.head()

C:\Users\FaridSarwari\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3146: DtypeWarning: Columns (1,2) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

,customer_id,order,total_sales,date,site
0,CanonicalUserID,OrderID,TotalIncTax,WhenPlaced,SiteID
1,A5DDA420-302C-49C1-A85F-00010646EF9F,1000586,117.11,13/10/2019 13:20,NLB2C
2,18DBDE67-B2B3-4DA4-84F4-0003289438DF,1465844,45.4,29/08/2021 12:36,NLB2C
3,D10B31A4-D79A-42BB-BBB5-0004434B7E1E,1326466,63.49,08/02/2021 11:49,UKB2C
4,D10B31A4-D79A-42BB-BBB5-0004434B7E1E,1422717,28,23/06/2021 22:27,UKB2C

In [255]:
### Our existing columns have also been imported into the dataframe, we would just select data from the first row

bgs_raw_df = bgs_raw.iloc[1:, : ]
bgs_raw_df.head()

,customer_id,order,total_sales,date,site
1,A5DDA420-302C-49C1-A85F-00010646EF9F,1000586,117.11,13/10/2019 13:20,NLB2C
2,18DBDE67-B2B3-4DA4-84F4-0003289438DF,1465844,45.4,29/08/2021 12:36,NLB2C
3,D10B31A4-D79A-42BB-BBB5-0004434B7E1E,1326466,63.49,08/02/2021 11:49,UKB2C
4,D10B31A4-D79A-42BB-BBB5-0004434B7E1E,1422717,28,23/06/2021 22:27,UKB2C
5,094F69A9-34AA-4196-952D-000467E02E8B,746149,67.67,03/01/2018 20:22,UKB2C

In [257]:
### Date column we would need to tranform to Datetime and Total_sales should be an intger or float

bgs_raw.dtypes

customer_id    object
order          object
total_sales    object
date           object
site           object
dtype: object

In [259]:
### There are 4 unique site IDs correseponding to the difference regions where the revenue is measured. 

### Revenue for UK2BC is measured in GBP, whereas the other sites revenue is measured in EUR, so we would to convert the revenue from other EU sites to GBP, by implementing an exchange rate scalar to the Total_sales column.

bgs_raw_df.site.unique()

array(['NLB2C', 'UKB2C', 'DEB2C', 'FRB2C'], dtype=object)

In [260]:
## Transform date to datetime

bgs_raw_df['date'] = pd.to_datetime(bgs_raw_df['date'], format= '%d/%m/%Y %H:%M')

<ipython-input-260-408985d75ad4>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  bgs_raw_df['date'] = pd.to_datetime(bgs_raw_df['date'], format= '%d/%m/%Y %H:%M')

In [264]:
## Tansform 'Total_sales' to an integer or float so that we are apply numerical transformations


bgs_raw_df['total_sales'] = pd.to_numeric(bgs_raw_df['total_sales'])

<ipython-input-264-8aa167586f56>:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  bgs_raw_df['total_sales'] = pd.to_numeric(bgs_raw_df['total_sales'])

In [262]:
bgs_raw_df.dtypes

customer_id            object
order                  object
total_sales           float64
date           datetime64[ns]
site                   object
dtype: object

In [92]:
bgs_raw_df.head()

,customer_id,order,total_sales,date,site
1,A5DDA420-302C-49C1-A85F-00010646EF9F,1000586,117.11,2019-10-13 13:20:00,NLB2C
2,18DBDE67-B2B3-4DA4-84F4-0003289438DF,1465844,45.40,2021-08-29 12:36:00,NLB2C
3,D10B31A4-D79A-42BB-BBB5-0004434B7E1E,1326466,63.49,2021-02-08 11:49:00,UKB2C
4,D10B31A4-D79A-42BB-BBB5-0004434B7E1E,1422717,28.00,2021-06-23 22:27:00,UKB2C
5,094F69A9-34AA-4196-952D-000467E02E8B,746149,67.67,2018-01-03 20:22:00,UKB2C

#### Creating a month-year column to groupby month

In [93]:
bgs_raw_df['month_yr'] =bgs_raw_df['date'].apply(lambda x: x.strftime('%b-%Y'))
bgs_raw_df.head()

<ipython-input-93-b94da4d9e08e>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  bgs_raw_df['month_yr'] =bgs_raw_df['date'].apply(lambda x: x.strftime('%b-%Y'))

,customer_id,order,total_sales,date,site,month_yr
1,A5DDA420-302C-49C1-A85F-00010646EF9F,1000586,117.11,2019-10-13 13:20:00,NLB2C,Oct-2019
2,18DBDE67-B2B3-4DA4-84F4-0003289438DF,1465844,45.40,2021-08-29 12:36:00,NLB2C,Aug-2021
3,D10B31A4-D79A-42BB-BBB5-0004434B7E1E,1326466,63.49,2021-02-08 11:49:00,UKB2C,Feb-2021
4,D10B31A4-D79A-42BB-BBB5-0004434B7E1E,1422717,28.00,2021-06-23 22:27:00,UKB2C,Jun-2021
5,094F69A9-34AA-4196-952D-000467E02E8B,746149,67.67,2018-01-03 20:22:00,UKB2C,Jan-2018

### BGS FR&DE&NL Revenue

In [184]:
df_bgs_euro = bgs_raw_df[bgs_raw_df['site']!='UKB2C']

In [188]:
df_bgs_euro.site.unique()

array(['NLB2C', 'DEB2C', 'FRB2C'], dtype=object)

In [198]:
df_bgs_euro.head()

,customer_id,order,total_sales,date,site,month_yr
1,A5DDA420-302C-49C1-A85F-00010646EF9F,1000586,117.11,2019-10-13 13:20:00,NLB2C,Oct-2019
2,18DBDE67-B2B3-4DA4-84F4-0003289438DF,1465844,45.40,2021-08-29 12:36:00,NLB2C,Aug-2021
6,85D90824-AF8A-42A6-97C8-0005ACF17DBA,845431,56.90,2018-10-15 21:46:00,NLB2C,Oct-2018
22,7ED91C06-2841-4C2C-A5B6-000854120774,1002639,17.90,2019-10-18 16:25:00,NLB2C,Oct-2019
23,8F8913D5-51C7-456A-BD6B-00092D174B67,1122255,42.40,2020-05-08 18:06:00,NLB2C,May-2020

In [193]:
df_bgs_euro.dtypes

customer_id            object
order                  object
total_sales           float64
date           datetime64[ns]
site                   object
month_yr               object
dtype: object

In [199]:
df_bgs_euro_adjust = df_bgs_euro.copy()

In [200]:
### Implement a scalar latest exchange rate EUR/GBP = 1/1.17 ~ approximately 0.857

df_bgs_euro_adjust ['total_sales']= 0.8547 * df_bgs_euro_adjust ['total_sales']
df_bgs_euro_adjust.head()

,customer_id,order,total_sales,date,site,month_yr
1,A5DDA420-302C-49C1-A85F-00010646EF9F,1000586,100.093917,2019-10-13 13:20:00,NLB2C,Oct-2019
2,18DBDE67-B2B3-4DA4-84F4-0003289438DF,1465844,38.803380,2021-08-29 12:36:00,NLB2C,Aug-2021
6,85D90824-AF8A-42A6-97C8-0005ACF17DBA,845431,48.632430,2018-10-15 21:46:00,NLB2C,Oct-2018
22,7ED91C06-2841-4C2C-A5B6-000854120774,1002639,15.299130,2019-10-18 16:25:00,NLB2C,Oct-2019
23,8F8913D5-51C7-456A-BD6B-00092D174B67,1122255,36.239280,2020-05-08 18:06:00,NLB2C,May-2020

In [201]:
### Total Revenue for the European Market by month

df_eu_total_revenue = df_bgs_euro.groupby('month_yr')[['total_sales']].sum()
df_eu_total_revenue.head()

          total_sales
month_yr
Apr-2017    144446.92
Apr-2018    168124.88
Apr-2019    243964.71
Apr-2020    305040.94
Apr-2021    373932.80

#### Total Revenue UK

In [175]:
bgs_raw_df.head()

,customer_id,order,total_sales,date,site,month_yr
1,A5DDA420-302C-49C1-A85F-00010646EF9F,1000586,117.11,2019-10-13 13:20:00,NLB2C,Oct-2019
2,18DBDE67-B2B3-4DA4-84F4-0003289438DF,1465844,45.40,2021-08-29 12:36:00,NLB2C,Aug-2021
3,D10B31A4-D79A-42BB-BBB5-0004434B7E1E,1326466,63.49,2021-02-08 11:49:00,UKB2C,Feb-2021
4,D10B31A4-D79A-42BB-BBB5-0004434B7E1E,1422717,28.00,2021-06-23 22:27:00,UKB2C,Jun-2021
5,094F69A9-34AA-4196-952D-000467E02E8B,746149,67.67,2018-01-03 20:22:00,UKB2C,Jan-2018

In [174]:
bgs_raw_df.site.unique()

array(['NLB2C', 'UKB2C', 'DEB2C', 'FRB2C'], dtype=object)

In [185]:
df_bgs_uk = bgs_raw_df[bgs_raw_df['site']=='UKB2C']

In [186]:
df_bgs_uk.head()

,customer_id,order,total_sales,date,site,month_yr
3,D10B31A4-D79A-42BB-BBB5-0004434B7E1E,1326466,63.49,2021-02-08 11:49:00,UKB2C,Feb-2021
4,D10B31A4-D79A-42BB-BBB5-0004434B7E1E,1422717,28.00,2021-06-23 22:27:00,UKB2C,Jun-2021
5,094F69A9-34AA-4196-952D-000467E02E8B,746149,67.67,2018-01-03 20:22:00,UKB2C,Jan-2018
7,07BCA8D0-2465-4002-9C1E-0005B14E9FD7,711848,60.39,2017-09-19 15:55:00,UKB2C,Sep-2017
8,07BCA8D0-2465-4002-9C1E-0005B14E9FD7,800910,61.39,2018-06-17 14:09:00,UKB2C,Jun-2018

In [181]:
df_uk_total_revenue = df_bgs_uk.groupby('month_yr')[['total_sales']].sum()
df_uk_total_revenue.head()

          total_sales
month_yr
Apr-2017   143365.240
Apr-2018   163812.660
Apr-2019   203066.294
Apr-2020   337276.460
Apr-2021   238784.430

#### Currency Adjusted Revenue

In [248]:
df_currency_adjusted = pd.concat([df_bgs_euro_adjust, df_bgs_uk], axis=0)

In [249]:
df_currency_adjusted.head()

,customer_id,order,total_sales,date,site,month_yr
1,A5DDA420-302C-49C1-A85F-00010646EF9F,1000586,100.093917,2019-10-13 13:20:00,NLB2C,Oct-2019
2,18DBDE67-B2B3-4DA4-84F4-0003289438DF,1465844,38.803380,2021-08-29 12:36:00,NLB2C,Aug-2021
6,85D90824-AF8A-42A6-97C8-0005ACF17DBA,845431,48.632430,2018-10-15 21:46:00,NLB2C,Oct-2018
22,7ED91C06-2841-4C2C-A5B6-000854120774,1002639,15.299130,2019-10-18 16:25:00,NLB2C,Oct-2019
23,8F8913D5-51C7-456A-BD6B-00092D174B67,1122255,36.239280,2020-05-08 18:06:00,NLB2C,May-2020

In [206]:
df_currency_adjusted.site.unique()

array(['NLB2C', 'DEB2C', 'FRB2C', 'UKB2C'], dtype=object)

#### Identifying all customers with a first purchase - Total Revenue and Number of First Customers

In [151]:
df_first1 = bgs_raw_df.sort_values(['date']).groupby('customer_id').first()
df_first1.head()

,order,total_sales,date,site,month_yr
customer_id,,,,,
000020BA-0E21-4246-9968-6ED13113768A,1165351,14.00,2020-06-30 20:16:00,UKB2C,Jun-2020
00004040-BFD2-492B-A752-BE9459B3FE22,1075381,42.85,2020-03-19 11:02:00,NLB2C,Mar-2020
000058D5-2DBE-4251-8448-9B1CFA15FF49,756499,61.82,2018-02-03 00:38:00,FRB2C,Feb-2018
00008280-429D-495F-BB87-893438746905,945161,21.62,2019-06-07 13:45:00,NLB2C,Jun-2019
0000C6A2-65BD-4E02-B96E-8E0E8CC25235,1455784,51.96,2021-08-11 14:28:00,NLB2C,Aug-2021

In [66]:
len(bgs_raw_df.customer_id.unique())

223575

In [159]:
first_orders = bgs_raw_df.sort_values(['date']).groupby('customer_id').first()
first_orders.head()

,order,total_sales,date,site,month_yr
customer_id,,,,,
000020BA-0E21-4246-9968-6ED13113768A,1165351,14.00,2020-06-30 20:16:00,UKB2C,Jun-2020
00004040-BFD2-492B-A752-BE9459B3FE22,1075381,42.85,2020-03-19 11:02:00,NLB2C,Mar-2020
000058D5-2DBE-4251-8448-9B1CFA15FF49,756499,61.82,2018-02-03 00:38:00,FRB2C,Feb-2018
00008280-429D-495F-BB87-893438746905,945161,21.62,2019-06-07 13:45:00,NLB2C,Jun-2019
0000C6A2-65BD-4E02-B96E-8E0E8CC25235,1455784,51.96,2021-08-11 14:28:00,NLB2C,Aug-2021

In [168]:
first_orders =first_orders.reset_index()

In [171]:
df_first_grouped1 = first_orders.groupby("month_yr").agg({"customer_id": lambda num: num.count()})

In [263]:
df_first_grouped1.head()

          customer_id
month_yr
Apr-2017         3277
Apr-2018         2328
Apr-2019         4382
Apr-2020         7724
Apr-2021         5278

In [161]:
df_first_order_revenue = first_orders.groupby('month_yr')[['total_sales']].sum()
df_first_order_revenue.head()

          total_sales
month_yr
Apr-2017    160708.25
Apr-2018    101386.02
Apr-2019    173532.29
Apr-2020    295470.03
Apr-2021    213051.74

In [162]:
#Importing to csv


df_first_order_revenue.to_csv('bgs_first_orders_rev.csv')
df_first_grouped1.to_csv('bgs_all_first_orders.csv')

#### Identifying Repeat Customers - Customers who made more than a single purchase

In [265]:
#These are customers with more than 1 customer IDs and so could be said to be duplicates as customer_id column pertain to number of orders and customer count

df_duplicate1 = bgs_raw_df[bgs_raw_df.customer_id.duplicated(keep=False)].groupby(['customer_id', 'date', 'month_yr']).sum().reset_index()
df_duplicate1.head()

KeyError: 'month_yr'

In [143]:
df_first = df_duplicate1.sort_values(['date']).groupby('customer_id').first()
df_first.head()

,date,month_yr,total_sales
customer_id,,,
00008280-429D-495F-BB87-893438746905,2019-06-07 13:45:00,Jun-2019,21.62
0002986C-781F-4E03-9CFA-F77CA5E89649,2020-02-28 10:15:00,Feb-2020,34.08
0002EC82-C129-4573-8104-04BAF40230AD,2020-10-09 16:00:00,Oct-2020,34.33
000443B3-11A4-4776-A60E-DBD9E47D0698,2020-01-22 05:45:00,Jan-2020,57.09
00051E9E-1A3B-4AA9-BED9-2E3D6377B88F,2021-02-19 19:13:00,Feb-2021,16.63

In [144]:
df_first = df_first.reset_index()

In [145]:
df_first.head()

,customer_id,date,month_yr,total_sales
0,00008280-429D-495F-BB87-893438746905,2019-06-07 13:45:00,Jun-2019,21.62
1,0002986C-781F-4E03-9CFA-F77CA5E89649,2020-02-28 10:15:00,Feb-2020,34.08
2,0002EC82-C129-4573-8104-04BAF40230AD,2020-10-09 16:00:00,Oct-2020,34.33
3,000443B3-11A4-4776-A60E-DBD9E47D0698,2020-01-22 05:45:00,Jan-2020,57.09
4,00051E9E-1A3B-4AA9-BED9-2E3D6377B88F,2021-02-19 19:13:00,Feb-2021,16.63

In [146]:
df_first_grouped = df_first.groupby("month_yr").agg({"customer_id": lambda num: num.count()})

In [150]:
df_first_grouped.head()

          customer_id
month_yr
Apr-2017         1824
Apr-2018          969
Apr-2019         1533
Apr-2020         2314
Apr-2021          790

In [149]:
df_first_grouped.to_csv('bgs_first_order.csv')

In [95]:
first_orders = first_orders.reset_index()

In [96]:
first_orders.head()

,customer_id,order,total_sales,date,site,month_yr
0,000020BA-0E21-4246-9968-6ED13113768A,1165351,14.00,2020-06-30 20:16:00,UKB2C,Jun-2020
1,00004040-BFD2-492B-A752-BE9459B3FE22,1075381,42.85,2020-03-19 11:02:00,NLB2C,Mar-2020
2,000058D5-2DBE-4251-8448-9B1CFA15FF49,756499,61.82,2018-02-03 00:38:00,FRB2C,Feb-2018
3,00008280-429D-495F-BB87-893438746905,945161,21.62,2019-06-07 13:45:00,NLB2C,Jun-2019
4,0000C6A2-65BD-4E02-B96E-8E0E8CC25235,1455784,51.96,2021-08-11 14:28:00,NLB2C,Aug-2021

In [ ]:
df_repeat_order = out.groupby("month_yr").agg({"customer_id": lambda num: num.count()})

In [125]:
len(first_orders.customer_id)

223575

In [126]:
len(bgs_raw_df.customer_id)

490115

In [111]:
print( all_cust - first)

266540

In [97]:
ids = first_orders.order

In [102]:
ids

0         1165351
1         1075381
2          756499
3          945161
4         1455784
           ...
223570    1005091
223571     797034
223572    1371176
223573     693207
223574    1348103
Name: order, Length: 223575, dtype: object

In [77]:
 bgs_raw_df.dtypes

customer_id            object
oder                   object
total_sales           float64
date           datetime64[ns]
site                   object
month_yr               object
dtype: object

In [130]:
out = pd.merge(bgs_raw_df,first_orders, how='outer', indicator=True)
out = out[out._merge.ne('both')].drop('_merge',1)

In [105]:
print(out.loc[out['order'] == '1348103'])

Empty DataFrame
Columns: [customer_id, order, total_sales, date, site, month_yr, _merge]
Index: []

In [112]:
repeat_total_revenue = out.groupby('month_yr')[['total_sales']].sum()

In [173]:
repeat_total_revenue.head()

          total_sales
month_yr
Apr-2017   287812.160
Apr-2018   331937.540
Apr-2019   447031.004
Apr-2020   642317.400
Apr-2021   612717.230

In [131]:
out.shape

(266540, 6)

In [132]:
df_repeat_order = out.groupby("month_yr").agg({"customer_id": lambda num: num.count()})

In [133]:
df_repeat_order.head()

          customer_id
month_yr
Apr-2017         2255
Apr-2018         3948
Apr-2019         4628
Apr-2020         6267
Apr-2021         6807

In [135]:
result = pd.concat([df_repeat_order, repeat_total_revenue], axis=1)

In [138]:
result.head()

          customer_id  total_sales
month_yr
Apr-2017         2255   287812.160
Apr-2018         3948   331937.540
Apr-2019         4628   447031.004
Apr-2020         6267   642317.400
Apr-2021         6807   612717.230

In [137]:
result.to_csv('bgs_repeat_orders_and_rev.csv')

In [35]:
bgs_raw_df.customer_id.unique()

array(['A5DDA420-302C-49C1-A85F-00010646EF9F',
       '18DBDE67-B2B3-4DA4-84F4-0003289438DF',
       'D10B31A4-D79A-42BB-BBB5-0004434B7E1E', ...,
       '852429D1-B3FA-4252-84A7-FFF765AC266C',
       'B63DF32E-1C40-4C19-8E8E-FFFA241895CD',
       '6DA77EA5-5FA6-4A20-A08B-FFFC252ADDD2'], dtype=object)

In [36]:
ids = bgs_raw_df['customer_id'].unique()

In [52]:
bgs_raw_df_copy = bgs_raw_df.copy()

In [57]:
bgs_raw_df_copy = bgs_raw_df_copy.drop_duplicates(subset='customer_id', keep="last")

In [58]:
bgs_raw_df_copy.shape

(223575, 6)

In [47]:
subset_df = bgs_raw_df[bgs_raw_df['customer_id'].isin(ids)].groupby(['month_yr', 'customer_id']).sum().reset_index()

In [48]:
subset_df .head()

   month_yr                           customer_id  total_sales
0  Apr-2017  002FBF1C-2989-4365-824B-C6FDF7B66CDC        16.40
1  Apr-2017  0044B440-7F99-4707-9F2C-31046F660336        36.18
2  Apr-2017  005EA510-C735-4BA6-BAA0-0601916988C3        43.71
3  Apr-2017  006A6E8C-68E2-4E3A-B836-B1C57E6A789F        17.10
4  Apr-2017  00711346-03F7-483A-B066-F2CD6A7A3310       121.41

In [59]:
df_subset = bgs_raw_df_copy.groupby("month_yr").agg({"customer_id": lambda num: num.count(),
                                      "total_sales": lambda price: price.sum()})

In [60]:
df_subset.head()

          customer_id  total_sales
month_yr
Apr-2017         2142     92606.14
Apr-2018         2159     95922.31
Apr-2019         4126    164055.06
Apr-2020         7428    285375.32
Apr-2021         6613    288359.03

In [61]:
df_subset = df_subset.reset_index()

In [64]:
df_subset.to_csv('bgs_month_unique_customers.csv')

In [18]:
total_orders = bgs_raw_df.groupby('month_yr')[['customer_id']].count()

In [30]:
total_orders.head()

   month_yr  total_orders
0  Apr-2017          5532
1  Apr-2018          6276
2  Apr-2019          9010
3  Apr-2020         13991
4  Apr-2021         12085

In [29]:
total_orders = total_orders.rename(columns={'total_oders': 'total_orders'}).reset_index()

In [31]:
total_order.to_csv('bgs_total_orders_by_month.csv')

In [25]:
total_revenue = bgs_raw_df.groupby('month_yr')[['total_sales']].sum()

In [26]:
total_revenue.head()

          total_sales
month_yr
Apr-2017   287812.160
Apr-2018   331937.540
Apr-2019   447031.004
Apr-2020   642317.400
Apr-2021   612717.230

In [27]:
total_revenue.to_csv('bgs_total_revenue_by_month.csv')

### TOTAL REVENUE

In [215]:
df_currency_adjusted.shape

(490115, 6)

In [216]:
df_currency_adjusted.head()

,customer_id,order,total_sales,date,site,month_yr
1,A5DDA420-302C-49C1-A85F-00010646EF9F,1000586,100.093917,2019-10-13 13:20:00,NLB2C,Oct-2019
2,18DBDE67-B2B3-4DA4-84F4-0003289438DF,1465844,38.803380,2021-08-29 12:36:00,NLB2C,Aug-2021
6,85D90824-AF8A-42A6-97C8-0005ACF17DBA,845431,48.632430,2018-10-15 21:46:00,NLB2C,Oct-2018
22,7ED91C06-2841-4C2C-A5B6-000854120774,1002639,15.299130,2019-10-18 16:25:00,NLB2C,Oct-2019
23,8F8913D5-51C7-456A-BD6B-00092D174B67,1122255,36.239280,2020-05-08 18:06:00,NLB2C,May-2020

In [217]:
df_total_rev_adjusted = df_currency_adjusted.groupby('month_yr')[['total_sales']].sum()
df_total_rev_adjusted.head()

            total_sales
month_yr
Apr-2017  266824.022524
Apr-2018  307508.994936
Apr-2019  411582.931637
Apr-2020  597994.951418
Apr-2021  558384.794160

In [218]:
df_total_rev_adjusted.to_csv('total_rev_adjusted.csv')

### CULMULATIVE NEW CUSTOMER REVENUE

In [220]:
df_currency_adjusted.head()

,customer_id,order,total_sales,date,site,month_yr
1,A5DDA420-302C-49C1-A85F-00010646EF9F,1000586,100.093917,2019-10-13 13:20:00,NLB2C,Oct-2019
2,18DBDE67-B2B3-4DA4-84F4-0003289438DF,1465844,38.803380,2021-08-29 12:36:00,NLB2C,Aug-2021
6,85D90824-AF8A-42A6-97C8-0005ACF17DBA,845431,48.632430,2018-10-15 21:46:00,NLB2C,Oct-2018
22,7ED91C06-2841-4C2C-A5B6-000854120774,1002639,15.299130,2019-10-18 16:25:00,NLB2C,Oct-2019
23,8F8913D5-51C7-456A-BD6B-00092D174B67,1122255,36.239280,2020-05-08 18:06:00,NLB2C,May-2020

In [221]:
df_currency_adjusted['order_number'] = df_currency_adjusted.sort_values(['customer_id', 'date'], ascending=[False, True]).groupby(['customer_id']).cumcount() + 1

In [235]:
df_currency_adjusted.head(100)

,customer_id,order,total_sales,date,site,month_yr,order_number
1,A5DDA420-302C-49C1-A85F-00010646EF9F,1000586,100.093917,2019-10-13 13:20:00,NLB2C,Oct-2019,1
2,18DBDE67-B2B3-4DA4-84F4-0003289438DF,1465844,38.803380,2021-08-29 12:36:00,NLB2C,Aug-2021,4
6,85D90824-AF8A-42A6-97C8-0005ACF17DBA,845431,48.632430,2018-10-15 21:46:00,NLB2C,Oct-2018,1
22,7ED91C06-2841-4C2C-A5B6-000854120774,1002639,15.299130,2019-10-18 16:25:00,NLB2C,Oct-2019,1
23,8F8913D5-51C7-456A-BD6B-00092D174B67,1122255,36.239280,2020-05-08 18:06:00,NLB2C,May-2020,1
...,...,...,...,...,...,...,...
182,E8294020-DBA7-44E4-9D9D-002EEC3B2E00,1290087,115.726380,2020-12-18 12:25:00,NLB2C,Dec-2020,4
184,8E0F2EA9-B50A-42A1-8730-002F9817CE8D,1135247,23.393139,2020-05-23 19:08:00,DEB2C,May-2020,1
186,34F8DA03-B9FE-4F82-9139-0031AF19B241,1342427,46.051236,2021-03-04 12:49:00,NLB2C,Mar-2021,1
187,35576D53-BD43-4952-B58B-003372248A7F,813237,13.119645,2018-07-19 16:24:00,DEB2C,Jul-2018,1
188,0E59D9A2-E4E6-465B-AF78-003559A17769,672279,20.931603,2017-05-11 10:45:00,DEB2C,May-2017,1

In [244]:
df_currency_adjusted.order_number.max()

4976

In [245]:
df_currency_adjusted.loc[df_currency_adjusted['order_number'] == 4976]

,customer_id,order,total_sales,date,site,month_yr,order_number
250485,3A1E512E-A969-48B7-B562-876B45933357,1446988,5.085465,2021-07-28 12:27:00,DEB2C,Jul-2021,4976

In [247]:
df_currency_adjusted.loc[df_currency_adjusted['customer_id'] == '3A1E512E-A969-48B7-B562-876B45933357']

,customer_id,order,total_sales,date,site,month_yr,order_number
250162,3A1E512E-A969-48B7-B562-876B45933357,638279,9.358965,2017-01-02 08:14:00,DEB2C,Jan-2017,1
250163,3A1E512E-A969-48B7-B562-876B45933357,638280,8.743581,2017-01-02 08:14:00,DEB2C,Jan-2017,2
250164,3A1E512E-A969-48B7-B562-876B45933357,638281,11.658108,2017-01-02 08:14:00,DEB2C,Jan-2017,3
250165,3A1E512E-A969-48B7-B562-876B45933357,638282,37.435860,2017-01-02 08:14:00,DEB2C,Jan-2017,4
250166,3A1E512E-A969-48B7-B562-876B45933357,1080179,12.777765,2020-03-23 07:43:00,DEB2C,Mar-2020,4959
...,...,...,...,...,...,...,...
260557,3A1E512E-A969-48B7-B562-876B45933357,640455,13.299132,2017-01-09 11:08:00,DEB2C,Jan-2017,40
260558,3A1E512E-A969-48B7-B562-876B45933357,641040,13.205115,2017-01-11 09:57:00,DEB2C,Jan-2017,43
260559,3A1E512E-A969-48B7-B562-876B45933357,641270,19.059810,2017-01-12 07:59:00,DEB2C,Jan-2017,45
260560,3A1E512E-A969-48B7-B562-876B45933357,641271,13.299132,2017-01-12 07:59:00,DEB2C,Jan-2017,46
260561,3A1E512E-A969-48B7-B562-876B45933357,641272,9.358965,2017-01-12 07:59:00,DEB2C,Jan-2017,47

In [250]:
df_currency_adjusted.to_pickle('df_currency_adjusted.pkl')

In [ ]:
df_currency_adjusted.loc[df_currency_adjusted['customer_id']